driver-tests/bpelse/assign/AssignJbi/test/echoByteDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoByteDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoByteDataType">
    <string>2</string>
    <normalizedString>2</normalizedString>
    <token>2</token>
    <base64Binary>2</base64Binary>
    <hexBinary>2</hexBinary>
    <integer>2</integer>
    <positiveInteger>2</positiveInteger>
    <negativeInteger>2</negativeInteger>
    <nonNegativeInteger>2</nonNegativeInteger>
    <nonPositiveInteger>2</nonPositiveInteger>
    <long>2</long>
    <unsignedLong>2</unsignedLong>
    <int>2</int>
    <unsignedInt>2</unsignedInt>
    <short>2</short>
    <unsignedShort>2</unsignedShort>
    <byte>2</byte>
    <unsignedByte>2</unsignedByte>
    <decimal>2</decimal>
    <float>2</float>
    <double>2</double>
    <boolean>2</boolean>
    <duration>2</duration>
    <dateTime>2</dateTime>
    <date>2</date>
    <time>2</time>
    <gYear>2</gYear>
    <gYearMonth>2</gYearMonth>
    <gMonth>2</gMonth>
    <gMonthDay>2</gMonthDay>
    <gDay>2</gDay>
    <Name>2</Name>
    <QName>2</QName>
    <NCName>2</NCName>
    <anyURI>2</anyURI>
    <language>2</language>
    <ID>2</ID>
    <IDREF>2</IDREF>
    <IDREFS>2</IDREFS>
    <ENTITY>2</ENTITY>
    <ENTITIES>2</ENTITIES>
    <NMTOKEN>2</NMTOKEN>
    <NMTOKENS>2</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
